import pytest

from .encode import encode_text


@pytest.mark.parametrize(
    "decoded, expected",
    [
        (
            "привет, любимая!",
            "5555 6 4 222 33 666 11 0 4444 999 22 4 5 2 9999 1111",
        ),
        (
            "я люблю питон?",
            "9999 0 4444 999 22 4444 999 0 5555 4 666 555 55 111",
        ),
        (
            "давным давно... в далекой далекой галактике...",
            "3 2 222 55 8888 5 0 3 2 222 55 555 1 1 1 0 222 0 3 2 4444 33 444 555 44 0 3 2 4444 33 444 555 44 0 2222 2 4444 2 444 666 4 444 33 1 1 1",
        ),
        (
            "красивый, злой, страшный; отважный: интересный! стоп, старт.!?",
            "444 6 2 66 4 222 8888 44 11 0 3333 4444 555 44 11 0 66 666 6 2 8 55 8888 44 111111 0 555 666 222 2 333 55 8888 44 11111 0 4 55 666 33 6 33 66 55 8888 44 1111 0 66 666 555 5555 11 0 66 666 2 6 666 1 1111 111",
        )
    ]
)
def test_decode_success(decoded: str, expected: str):
    assert encode_text(decoded) == expected


@pytest.mark.parametrize(
    "decoded",
    [
        "a",
        "b",
        "c",
        "1",
        "привет, любимая! cейчас я проснусь!"
        "в этот чудесный, れ вышел на улицу"
    ]
)
def test_decode_none(decoded: str):
    assert encode_text(decoded) is None
